In [1]:
import pandas as pd

In [2]:
data = {
    'Name' : ['Angela', 'Daniel', 'Daniel', 'Marko', 'Marko','Angela'],
    'Age' : [25,33,33,30, 32, 31]
}

In [3]:
df = pd.DataFrame(data)
df

     Name  Age
0  Angela   25
1  Daniel   33
2  Daniel   33
3   Marko   30
4   Marko   32
5  Angela   31

In [4]:
df['Name']

0    Angela
1    Daniel
2    Daniel
3     Marko
4     Marko
5    Angela
Name: Name, dtype: object

In [5]:
df['Age']

0    25
1    33
2    33
3    30
4    32
5    31
Name: Age, dtype: int64

In [6]:
df['Age'] >= 30

0    False
1     True
2     True
3     True
4     True
5     True
Name: Age, dtype: bool

In [7]:
filter_ = df['Age'] >= 30
df[filter_]

     Name  Age
1  Daniel   33
2  Daniel   33
3   Marko   30
4   Marko   32
5  Angela   31

In [8]:
df.groupby("Name").agg(
    {
        'Age' : "mean"
    }
)

         Age
Name
Angela  28.0
Daniel  33.0
Marko   31.0

In [9]:
g = df.groupby("Name").agg(
    {
        'Age' : "max"
    }
)

In [10]:
g.index

Index(['Angela', 'Daniel', 'Marko'], dtype='object', name='Name')

In [11]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [12]:
g.reset_index()

     Name  Age
0  Angela   31
1  Daniel   33
2   Marko   32

In [13]:
df.drop_duplicates()

     Name  Age
0  Angela   25
1  Daniel   33
3   Marko   30
4   Marko   32
5  Angela   31

In [14]:
df.drop_duplicates().reset_index()

   index    Name  Age
0      0  Angela   25
1      1  Daniel   33
2      3   Marko   30
3      4   Marko   32
4      5  Angela   31

In [15]:
df.drop_duplicates().reset_index(drop=True)

     Name  Age
0  Angela   25
1  Daniel   33
2   Marko   30
3   Marko   32
4  Angela   31